{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 29], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "conv0", "class_name": "Conv1D", "config": {"name": "conv0", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "conv0.1.1", "class_name": "Conv1D", "config": {"name": "conv0.1.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.1.1", 0, 0, {}]]]}, {"name": "relu0.1.1", "class_name": "Activation", "config": {"name": "relu0.1.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "spatial_dropout1d_1", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_1", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.1.1", 0, 0, {}]]]}, {"name": "conv0.1.2", "class_name": "Conv1D", "config": {"name": "conv0.1.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.1.2", 0, 0, {}]]]}, {"name": "relu0.1.2", "class_name": "Activation", "config": {"name": "relu0.1.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "spatial_dropout1d_2", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_2", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.1.2", 0, 0, {}]]]}, {"name": "relay0.1", "class_name": "Conv1D", "config": {"name": "relay0.1", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "add0.1", "class_name": "Add", "config": {"name": "add0.1", "trainable": true}, "inbound_nodes": [[["relay0.1", 0, 0, {}], ["spatial_dropout1d_2", 0, 0, {}]]]}, {"name": "linear0.1", "class_name": "Activation", "config": {"name": "linear0.1", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add0.1", 0, 0, {}]]]}, {"name": "conv0.2.1", "class_name": "Conv1D", "config": {"name": "conv0.2.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.2.1", 0, 0, {}]]]}, {"name": "relu0.2.1", "class_name": "Activation", "config": {"name": "relu0.2.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "spatial_dropout1d_3", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_3", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.2.1", 0, 0, {}]]]}, {"name": "conv0.2.2", "class_name": "Conv1D", "config": {"name": "conv0.2.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.2.2", 0, 0, {}]]]}, {"name": "relu0.2.2", "class_name": "Activation", "config": {"name": "relu0.2.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "spatial_dropout1d_4", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_4", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.2.2", 0, 0, {}]]]}, {"name": "relay0.2", "class_name": "Conv1D", "config": {"name": "relay0.2", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.1", 0, 0, {}]]]}, {"name": "add0.2", "class_name": "Add", "config": {"name": "add0.2", "trainable": true}, "inbound_nodes": [[["relay0.2", 0, 0, {}], ["spatial_dropout1d_4", 0, 0, {}]]]}, {"name": "linear0.2", "class_name": "Activation", "config": {"name": "linear0.2", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add0.2", 0, 0, {}]]]}, {"name": "conv0.4.1", "class_name": "Conv1D", "config": {"name": "conv0.4.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [4], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.2", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.4.1", 0, 0, {}]]]}, {"name": "relu0.4.1", "class_name": "Activation", "config": {"name": "relu0.4.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "spatial_dropout1d_5", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_5", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.4.1", 0, 0, {}]]]}, {"name": "conv0.4.2", "class_name": "Conv1D", "config": {"name": "conv0.4.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [4], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.4.2", 0, 0, {}]]]}, {"name": "relu0.4.2", "class_name": "Activation", "config": {"name": "relu0.4.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "spatial_dropout1d_6", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_6", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.4.2", 0, 0, {}]]]}, {"name": "relay0.4", "class_name": "Conv1D", "config": {"name": "relay0.4", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.2", 0, 0, {}]]]}, {"name": "add0.4", "class_name": "Add", "config": {"name": "add0.4", "trainable": true}, "inbound_nodes": [[["relay0.4", 0, 0, {}], ["spatial_dropout1d_6", 0, 0, {}]]]}, {"name": "linear0.4", "class_name": "Activation", "config": {"name": "linear0.4", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add0.4", 0, 0, {}]]]}, {"name": "conv0.8.1", "class_name": "Conv1D", "config": {"name": "conv0.8.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [8], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.4", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.8.1", 0, 0, {}]]]}, {"name": "relu0.8.1", "class_name": "Activation", "config": {"name": "relu0.8.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "spatial_dropout1d_7", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_7", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.8.1", 0, 0, {}]]]}, {"name": "conv0.8.2", "class_name": "Conv1D", "config": {"name": "conv0.8.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [8], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.8.2", 0, 0, {}]]]}, {"name": "relu0.8.2", "class_name": "Activation", "config": {"name": "relu0.8.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "spatial_dropout1d_8", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_8", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.8.2", 0, 0, {}]]]}, {"name": "relay0.8", "class_name": "Conv1D", "config": {"name": "relay0.8", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.4", 0, 0, {}]]]}, {"name": "add0.8", "class_name": "Add", "config": {"name": "add0.8", "trainable": true}, "inbound_nodes": [[["relay0.8", 0, 0, {}], ["spatial_dropout1d_8", 0, 0, {}]]]}, {"name": "linear0.8", "class_name": "Activation", "config": {"name": "linear0.8", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add0.8", 0, 0, {}]]]}, {"name": "conv0.16.1", "class_name": "Conv1D", "config": {"name": "conv0.16.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [16], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.8", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.16.1", 0, 0, {}]]]}, {"name": "relu0.16.1", "class_name": "Activation", "config": {"name": "relu0.16.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "spatial_dropout1d_9", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_9", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.16.1", 0, 0, {}]]]}, {"name": "conv0.16.2", "class_name": "Conv1D", "config": {"name": "conv0.16.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [16], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_9", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.16.2", 0, 0, {}]]]}, {"name": "relu0.16.2", "class_name": "Activation", "config": {"name": "relu0.16.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "spatial_dropout1d_10", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_10", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.16.2", 0, 0, {}]]]}, {"name": "relay0.16", "class_name": "Conv1D", "config": {"name": "relay0.16", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.8", 0, 0, {}]]]}, {"name": "add0.16", "class_name": "Add", "config": {"name": "add0.16", "trainable": true}, "inbound_nodes": [[["relay0.16", 0, 0, {}], ["spatial_dropout1d_10", 0, 0, {}]]]}, {"name": "linear0.16", "class_name": "Activation", "config": {"name": "linear0.16", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add0.16", 0, 0, {}]]]}, {"name": "conv0.32.1", "class_name": "Conv1D", "config": {"name": "conv0.32.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [32], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.16", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.32.1", 0, 0, {}]]]}, {"name": "relu0.32.1", "class_name": "Activation", "config": {"name": "relu0.32.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "spatial_dropout1d_11", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_11", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.32.1", 0, 0, {}]]]}, {"name": "conv0.32.2", "class_name": "Conv1D", "config": {"name": "conv0.32.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [32], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.32.2", 0, 0, {}]]]}, {"name": "relu0.32.2", "class_name": "Activation", "config": {"name": "relu0.32.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "spatial_dropout1d_12", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_12", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.32.2", 0, 0, {}]]]}, {"name": "relay0.32", "class_name": "Conv1D", "config": {"name": "relay0.32", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.16", 0, 0, {}]]]}, {"name": "add0.32", "class_name": "Add", "config": {"name": "add0.32", "trainable": true}, "inbound_nodes": [[["relay0.32", 0, 0, {}], ["spatial_dropout1d_12", 0, 0, {}]]]}, {"name": "linear0.32", "class_name": "Activation", "config": {"name": "linear0.32", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add0.32", 0, 0, {}]]]}, {"name": "conv0.64.1", "class_name": "Conv1D", "config": {"name": "conv0.64.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [64], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.32", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.64.1", 0, 0, {}]]]}, {"name": "relu0.64.1", "class_name": "Activation", "config": {"name": "relu0.64.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "spatial_dropout1d_13", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_13", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.64.1", 0, 0, {}]]]}, {"name": "conv0.64.2", "class_name": "Conv1D", "config": {"name": "conv0.64.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [64], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_13", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0.64.2", 0, 0, {}]]]}, {"name": "relu0.64.2", "class_name": "Activation", "config": {"name": "relu0.64.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "spatial_dropout1d_14", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_14", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu0.64.2", 0, 0, {}]]]}, {"name": "relay0.64", "class_name": "Conv1D", "config": {"name": "relay0.64", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.32", 0, 0, {}]]]}, {"name": "add0.64", "class_name": "Add", "config": {"name": "add0.64", "trainable": true}, "inbound_nodes": [[["relay0.64", 0, 0, {}], ["spatial_dropout1d_14", 0, 0, {}]]]}, {"name": "linear0.64", "class_name": "Activation", "config": {"name": "linear0.64", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add0.64", 0, 0, {}]]]}, {"name": "conv1.1.1", "class_name": "Conv1D", "config": {"name": "conv1.1.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.64", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1.1.1", 0, 0, {}]]]}, {"name": "relu1.1.1", "class_name": "Activation", "config": {"name": "relu1.1.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "spatial_dropout1d_15", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_15", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu1.1.1", 0, 0, {}]]]}, {"name": "conv1.1.2", "class_name": "Conv1D", "config": {"name": "conv1.1.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_15", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1.1.2", 0, 0, {}]]]}, {"name": "relu1.1.2", "class_name": "Activation", "config": {"name": "relu1.1.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "spatial_dropout1d_16", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_16", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu1.1.2", 0, 0, {}]]]}, {"name": "relay1.1", "class_name": "Conv1D", "config": {"name": "relay1.1", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear0.64", 0, 0, {}]]]}, {"name": "add1.1", "class_name": "Add", "config": {"name": "add1.1", "trainable": true}, "inbound_nodes": [[["relay1.1", 0, 0, {}], ["spatial_dropout1d_16", 0, 0, {}]]]}, {"name": "linear1.1", "class_name": "Activation", "config": {"name": "linear1.1", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add1.1", 0, 0, {}]]]}, {"name": "conv1.2.1", "class_name": "Conv1D", "config": {"name": "conv1.2.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear1.1", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_17", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1.2.1", 0, 0, {}]]]}, {"name": "relu1.2.1", "class_name": "Activation", "config": {"name": "relu1.2.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "spatial_dropout1d_17", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_17", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu1.2.1", 0, 0, {}]]]}, {"name": "conv1.2.2", "class_name": "Conv1D", "config": {"name": "conv1.2.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_17", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1.2.2", 0, 0, {}]]]}, {"name": "relu1.2.2", "class_name": "Activation", "config": {"name": "relu1.2.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "spatial_dropout1d_18", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_18", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu1.2.2", 0, 0, {}]]]}, {"name": "relay1.2", "class_name": "Conv1D", "config": {"name": "relay1.2", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear1.1", 0, 0, {}]]]}, {"name": "add1.2", "class_name": "Add", "config": {"name": "add1.2", "trainable": true}, "inbound_nodes": [[["relay1.2", 0, 0, {}], ["spatial_dropout1d_18", 0, 0, {}]]]}, {"name": "linear1.2", "class_name": "Activation", "config": {"name": "linear1.2", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add1.2", 0, 0, {}]]]}, {"name": "conv1.4.1", "class_name": "Conv1D", "config": {"name": "conv1.4.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [4], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear1.2", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1.4.1", 0, 0, {}]]]}, {"name": "relu1.4.1", "class_name": "Activation", "config": {"name": "relu1.4.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "spatial_dropout1d_19", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_19", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu1.4.1", 0, 0, {}]]]}, {"name": "conv1.4.2", "class_name": "Conv1D", "config": {"name": "conv1.4.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [4], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_19", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1.4.2", 0, 0, {}]]]}, {"name": "relu1.4.2", "class_name": "Activation", "config": {"name": "relu1.4.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "spatial_dropout1d_20", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_20", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu1.4.2", 0, 0, {}]]]}, {"name": "relay1.4", "class_name": "Conv1D", "config": {"name": "relay1.4", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear1.2", 0, 0, {}]]]}, {"name": "add1.4", "class_name": "Add", "config": {"name": "add1.4", "trainable": true}, "inbound_nodes": [[["relay1.4", 0, 0, {}], ["spatial_dropout1d_20", 0, 0, {}]]]}, {"name": "linear1.4", "class_name": "Activation", "config": {"name": "linear1.4", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add1.4", 0, 0, {}]]]}, {"name": "conv1.8.1", "class_name": "Conv1D", "config": {"name": "conv1.8.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [8], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear1.4", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_21", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1.8.1", 0, 0, {}]]]}, {"name": "relu1.8.1", "class_name": "Activation", "config": {"name": "relu1.8.1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "spatial_dropout1d_21", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_21", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu1.8.1", 0, 0, {}]]]}, {"name": "conv1.8.2", "class_name": "Conv1D", "config": {"name": "conv1.8.2", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [8], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_21", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_22", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1.8.2", 0, 0, {}]]]}, {"name": "relu1.8.2", "class_name": "Activation", "config": {"name": "relu1.8.2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"name": "spatial_dropout1d_22", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_22", "trainable": true, "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["relu1.8.2", 0, 0, {}]]]}, {"name": "relay1.8", "class_name": "Conv1D", "config": {"name": "relay1.8", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear1.4", 0, 0, {}]]]}, {"name": "add1.8", "class_name": "Add", "config": {"name": "add1.8", "trainable": true}, "inbound_nodes": [[["relay1.8", 0, 0, {}], ["spatial_dropout1d_22", 0, 0, {}]]]}, {"name": "linear1.8", "class_name": "Activation", "config": {"name": "linear1.8", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["add1.8", 0, 0, {}]]]}, {"name": "conv1.16.1", "class_name": "Conv1D", "config": {"name": "conv1.16.1", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [16], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["linear1.8", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_23", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, 